USE [Delivery_service]
GO 
INSERT INTO [Тип доставки] VALUES
(1,'Дверь-дверь', 570 ),
(2,'Склад-дверь', 470 ),
(3,'Дверь-склад', 350 ),
(4,'Склад-склад', 290 )
GO
INSERT INTO [Весовая категория]  VALUES
(1,'До 1 кг', 1 ),
(2,'1-5 кг', 2 ),
(3,'5-10 кг', 4 ),
(4,'Более 10 кг', 8 )
GO
INSERT INTO [Клиенты]  VALUES
('+79537368357',6111714863,'Васильева', 'Елизавета', 'Андреевна','VasilevaElizaveta101@yandex.ru', 'ул. Пушкина, дом 82, кв. 60' ),
('+78315967114',2567125489, 'Егоров', 'Родион', 'Данилович',NULL, 'ул. Зелёная, дом 32, кв.216' ),
('+79478727911',NULL, 'Кудрявцева', 'Виолетта', 'Аркадьевна', 'KudryavtsevaVioletta@mail.ru', NULL ),
('+79213451638',3925964823, 'Игнатьев', 'Юрий', 'Георгиевич','IgnatevYuriy22@gmail.com', 'ул. Авиамоторная, дом 5, кв. 164' ),
('+79361433763',6010756214, 'Чаурин', 'Ратмир', NULL, 'ChaurinRatmir82@yahoo.com','ул. Академическая, дом 13, кв. 270' ),
('+79437056116',7890672143, 'Власов', 'Вадим', 'Борисович','VlasovVadim@bk.ru', 'ул. Бартеневская, дом 65, кв. 93'),
('+79581453399',4629857319, 'Баранова', 'Ксения', 'Семеновна', NULL, 'ул. Барклая, дом 35, кв. 174'),
('+79129503554',NULL, 'Никифоров', 'Тихон', 'Сергеевич', 'NikiforovTihon1@ya.ru', 'ул. Журавлёва, дом 88, кв. 51' ),
('+79586956429',3915714814, 'Федотова', 'Валентина', 'Ефимовна', 'FedotovaValentina56@inbox.ru', NULL),
('+79378706550',5125681347, 'Власова', 'Алиса', 'Ярославовна', NULL, 'ул. Бебеля, дом 55, кв. 113')
GO
INSERT INTO [Город]  VALUES
(1, 'Москва', 'Московская', 495),
(2, 'Рязань', 'Рязанская', 4912),
(3, 'Санкт-Петербург', 'Ленинградская', 812),
(4, 'Нижний Новгород', 'Нижегородская', 8312),
(5, 'Тула', 'Тульская', 4872),
(6, 'Воронеж', 'Воронежская', 4732),
(7, 'Саратов', 'Саратовская', 8452),
(8, 'Самара', 'Самарская', 8462),
(9, 'Череповец', 'Вологодская', 8202),
(10, 'Калуга',	'Калужская',	4842)
GO
INSERT INTO [Пункт выдачи]  VALUES
(1, 2, 'ул. Маяковского, дом 14', 48378, '+79331278498', 0), 
(2, 7, 'ул. Садовая, дом 92', 10930, '+79331128498', 1),
(3, 4, 'ул. Гвардейская, дом 14', 39801, NULL, 1),
(4, 2, 'ул. Молодёжная, дом 98', 95456, '+79331278798', 1),
(5, 8, 'ул. Пушкина, дом 6,', 17721, '+79665937797', 1),
(6, 4, 'пл. Театральная, дом 4', 22642, '+79764486127', 0),
(7, 3, 'ул. Балтийская, дом 20', 27001, '+79651501917', 1),
(8, 10, 'ул. Молодёжная, дом 85', 96483, '+79612467497', 1),
(9, 4, 'ул. Строителей, дом 10', 38155, NULL, 0),
(10, 9, 'ул. Зелёная, дом 91', 99513, '+79417249919', 1),
(11, 8, 'пл. Ленина, дом 22', 43689, '+79179867532', 0),
(12, 1, 'ул. Московская, дом 3', 40558,'+79113138979', 0),
(13, 1, 'ул. 15 лет октября, дом 53', 19207, '+79582322897', 0), 
(14, 7, 'ул. Маяковского, дом 4', 46528, '+79808757680', 0),
(15, 8, 'ул. Герцена, дом 35', 77518, '+79729927376', 0),
(16, 5, 'ул. Заречная, дом 93', 14511, '+79729927376', 1),
(17, 1, 'пл. Свободы, дом 5', 18466, '+79102647740', 1), 
(18, 6, 'ул. Зеленая, дом 75', 78762, '+79789024130', 1),
(19, 7, 'ул. Советская, дом 52', 90870, '+79725912363', 0),
(20, 7, 'ул. Новая, дом 35', 86719, '+79001473215', 0)
GO